In [3]:
import pandas as pd

In [13]:
df1=pd.DataFrame({'ID':[1,2,3,4],
                 'class':[9,10,11,12]})
df2=pd.DataFrame({'ID':[1,2,5,6],
                 'class':[11,12,13,14]})
display(df1,df2)

   ID  class
0   1      9
1   2     10
2   3     11
3   4     12

   ID  class
0   1     11
1   2     12
2   5     13
3   6     14

In [14]:
pd.merge(df1,df2,on='ID') # data frame merge based on id label by default it merge on inner(intersection) join

   ID  class_x  class_y
0   1        9       11
1   2       10       12

In [15]:
# if we want change the position of class and name then

pd.merge(df2,df1,on='ID')

   ID  class_x  class_y
0   1       11        9
1   2       12       10

In [16]:
# now check inner join dataframe is same as the previous merge data or not

pd.merge(df1,df2,on='ID',how='inner') # it gives the same output

   ID  class_x  class_y
0   1        9       11
1   2       10       12

In [17]:
pd.merge(df1,df2,on='ID',how='right')

   ID  class_x  class_y
0   1      9.0       11
1   2     10.0       12
2   5      NaN       13
3   6      NaN       14

In [18]:
pd.merge(df1,df2,on='ID',how='left')

   ID  class_x  class_y
0   1        9     11.0
1   2       10     12.0
2   3       11      NaN
3   4       12      NaN

In [19]:
pd.merge(df1,df2  ,on='ID',how='outer') # outer mtlb sabhi diffrent value print ho jayengi

   ID  class_x  class_y
0   1      9.0     11.0
1   2     10.0     12.0
2   3     11.0      NaN
3   4     12.0      NaN
4   5      NaN     13.0
5   6      NaN     14.0

In [20]:
# ab dekhenge ki kon si value kis